1yib.rust-bundle
aaron-bond.better-comments
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
docker.docker
donjayamanne.githistory
dsznajder.es7-react-js-snippets
dustypomerleau.rust-syntax
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
fill-labs.dependi
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
foxundermoon.next-js
github.copilot
github.copilot-chat
golang.go
hashicorp.terraform
ionutvmi.path-autocomplete
junstyle.php-cs-fixer
mehedidracula.php-namespace-resolver
mhutchie.git-graph
mikestead.dotenv
mosapride.zenkaku
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
neilbrayfield.php-docblocker
openai.chatgpt
orta.vscode-jest
pkief.material-icon-theme
pranaygp.vscode-css-peek
prisma.prisma
ritwickdey.liveserver
rust-lang.rust-analyzer
saoudrizwan.claude-dev
serayuzgur.crates
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vitest.explorer
vue.volar
xdebug.php-debug
