tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "hashicorp/tap"
tap "rbenv/tap"
brew "openssl@3"
brew "gettext"
brew "glib"
brew "at-spi2-core"
brew "autoconf"
brew "automake"
brew "bison"
brew "freetype"
brew "ruby"
brew "cocoapods"
brew "gd"
brew "icu4c@77"
brew "krb5"
brew "libzip"
brew "php"
brew "composer"
brew "direnv"
brew "docker"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@6"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "python@3.13"
brew "git-filter-repo"
brew "gitleaks"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "gtk+3"
brew "gtk4"
brew "libsoup"
brew "py3cairo"
brew "pygobject3"
brew "gstreamer"
brew "jpeg"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "mingw-w64"
brew "mise"
brew "node"
brew "openblas"
brew "numpy"
brew "openvino"
brew "peco"
brew "php@8.1"
brew "python@3.11"
brew "python@3.12"
brew "re2c"
brew "rustup"
brew "terraform"
brew "tree"
brew "zlib"
brew "zsh"
brew "rbenv/tap/openssl@1.1"
cask "session-manager-plugin"
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.next-js"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vue.volar"
